export const southProvinces = [
  {
    name: 'ยะลา',
    districts: [
      {
        name: 'เมืองยะลา',
        subdistricts: ['สะเตง', 'สะเตงนอก', 'บุดี', 'ตาเซะ', 'ลำพะยา']
      },
      {
        name: 'เบตง',
        subdistricts: ['เบตง', 'ยะรม', 'ตาเนาะแมเราะ', 'อัยเยอร์เวง', 'ธารน้ำทิพย์']
      },
      {
        name: 'รามัน',
        subdistricts: ['กายูบอเกาะ', 'กาลูปัง', 'กาลอ', 'คอตี', 'จะกว๊ะ']
      }
    ]
  },
  {
    name: 'ปัตตานี',
    districts: [
      {
        name: 'เมืองปัตตานี',
        subdistricts: ['สะบารัง', 'อาเนาะรู', 'จะบังติกอ', 'บานา', 'ตันหยงลุโละ']
      },
      {
        name: 'โคกโพธิ์',
        subdistricts: ['โคกโพธิ์', 'มะกรูด', 'บางโกระ', 'ป่าบอน', 'ทรายขาว']
      },
      {
        name: 'หนองจิก',
        subdistricts: ['หนองจิก', 'ตุหยง', 'บ่อทอง', 'ท่ากำชำ', 'บางเขา']
      }
    ]
  },
  {
    name: 'นราธิวาส',
    districts: [
      {
        name: 'เมืองนราธิวาส',
        subdistricts: ['บางนาค', 'ลำภู', 'มะนังตายอ', 'บางปอ', 'กะลุวอ']
      },
      {
        name: 'ตากใบ',
        subdistricts: ['เจ๊ะเห', 'ไพรวัน', 'พร่อน', 'ศาลาใหม่', 'บางขุนทอง']
      },
      {
        name: 'สุไหงโก-ลก',
        subdistricts: ['สุไหงโก-ลก', 'ปาเสมัส', 'มูโนะ', 'ปูโยะ']
      }
    ]
  },
  {
    name: 'สงขลา',
    districts: [
      {
        name: 'เมืองสงขลา',
        subdistricts: ['บ่อยาง', 'เขารูปช้าง', 'เกาะแต้ว', 'พะวง', 'ทุ่งหวัง']
      },
      {
        name: 'หาดใหญ่',
        subdistricts: ['หาดใหญ่', 'ควนลัง', 'คอหงส์', 'ควนจง', 'ทุ่งตำเสา']
      },
      {
        name: 'จะนะ',
        subdistricts: ['บ้านนา', 'ป่าชิง', 'สะพานไม้แก่น', 'สะกอม', 'นาทวี']
      }
    ]
  },
  {
    name: 'สตูล',
    districts: [
      {
        name: 'เมืองสตูล',
        subdistricts: ['พิมาน', 'คลองขุด', 'ควนขัน', 'บ้านควน', 'ฉลุง']
      },
      {
        name: 'ควนโดน',
        subdistricts: ['ควนโดน', 'ควนสตอ', 'ย่านซื่อ', 'วังประจัน']
      },
      {
        name: 'ควนกาหลง',
        subdistricts: ['ทุ่งนุ้ย', 'ควนกาหลง', 'อุใดเจริญ']
      }
    ]
  }
];
